// Intro за двоична бройна система

// Какво е бройна система
// -Нотация за представяне на числата посредством ограничен брой символи, наречени цифри 

// Какво е двоична бройна система?
//  -Бройна система, представяща числата, посредством цифрите 1(едно) и 0(нула). Двоичната бройна система
//   е позиционна. Всяка цифра в едно двоично число наричаме бит

// Пример- числа записани двоично

//      десетична бр. с-ма          двоична бр. с-ма
                         0                         0
                   2^0 = 1                         1
                   2^1 = 2                        10
                         3                        11
                   2^2 = 4                       100
                         5                       101
                         6                       110
                         7                       111
                   2^3 = 8                      1000
                         9                      1001
                        10                      1010
                        .   .   .
                  2^4 = 16                     10000
                        17                     10001
                        .   .   .
                        31                     11111
                  2^5 = 32                    100000
                        .   .   .
                  2^6 = 64                   1000000
                        .   .   .
                        .   .   .
                        .   .   .
               2^10 = 1024               10000000000

// Конвертиране между десетична и двоична бройна система
// От десетична към двоична бройна система
    13 ÷ 2 = 6   остатък 1
    6 ÷ 2 = 3   остатък 0
    3 ÷ 2 = 1   остатък 1
    1 ÷ 2 = 0   остатък 1   ← спираме, защото частното е 0

// Сега четем остатъците отдолу нагоре:
1 1 0 1

// От двоична към десетична бройна система
      1   1   0   1 // стойност на бит
      ↑   ↑   ↑   ↑
      ↑   ↑   ↑   ↑
     [3,  2,  1,  0] // индекс на бит

     1×2³ + 1×2² + 0×2¹ + 1×2⁰
     = 8 + 4 + 0 + 1
     = 13

